app/controllers/registrations_controller.rb

 def create
    if session[:omniauth]
  	  if params[:uid].present?
         User.from_omniauth_twitter(session[:omniauth],params[:user][:email])
         @user = User.find_by_uid(params[:uid])
---
SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT 1  [["uid", "2182637210"]]