app/controllers/users/omniauth_callbacks_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."uid" = $1 LIMIT 1  [["uid", "2182637210"]]
---
  def twitter
    @existing_user = request.env["omniauth.auth"]
    @valid_user = User.find_by_uid(@existing_user.uid)